{"keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "bias_regularizer": null, "batch_input_shape": [null, 256, 256, 3], "name": "conv2d_1", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "dtype": "float32", "filters": 8}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "conv2d_2", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "filters": 16}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.15}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "conv2d_3", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "filters": 8}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_1", "trainable": true, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "conv2d_4", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "filters": 24}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "conv2d_5", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "filters": 12}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_2", "trainable": true, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "conv2d_6", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "trainable": true, "activation": "linear", "activity_regularizer": null, "kernel_size": [3, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "conv2d_7", "strides": [1, 1], "kernel_constraint": null, "bias_constraint": null, "dilation_rate": [1, 1], "use_bias": true, "padding": "same", "filters": 16}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3}}, {"class_name": "BatchNormalization", "config": {"center": true, "name": "batch_normalization_3", "trainable": true, "scale": true, "momentum": 0.99, "axis": -1, "beta_regularizer": null, "epsilon": 0.001, "beta_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_constraint": null, "use_bias": true}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}}]}