{"config": [{"config": {"kernel_constraint": null, "activity_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "filters": 8, "bias_regularizer": null, "name": "conv2d_1", "trainable": true, "use_bias": true, "dtype": "float32", "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "batch_input_shape": [null, 256, 256, 3], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_1", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 16, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.15}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 8, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_3", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"gamma_regularizer": null, "center": true, "name": "batch_normalization_1", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_2", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 24, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_4", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 12, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_5", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_3", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"gamma_regularizer": null, "center": true, "name": "batch_normalization_2", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"pool_size": [2, 2], "data_format": "channels_last", "padding": "valid", "name": "max_pooling2d_3", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 32, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_6", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "trainable": true, "rate": 0.25}, "class_name": "Dropout"}, {"config": {"kernel_constraint": null, "activity_regularizer": null, "filters": 16, "kernel_regularizer": null, "bias_regularizer": null, "name": "conv2d_7", "trainable": true, "use_bias": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "strides": [1, 1], "padding": "same", "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"name": "dropout_5", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"gamma_regularizer": null, "center": true, "name": "batch_normalization_3", "epsilon": 0.001, "trainable": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "beta_constraint": null, "momentum": 0.99, "scale": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"activity_regularizer": null, "units": 16, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_1", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_7", "activation": "relu", "trainable": true}, "class_name": "Activation"}, {"config": {"activity_regularizer": null, "units": 2, "kernel_regularizer": null, "kernel_constraint": null, "name": "dense_2", "trainable": true, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "linear", "use_bias": true, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_8", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "keras_version": "2.0.6", "backend": "tensorflow", "class_name": "Sequential"}