{"config": {"name": "errrr", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_regularizer": null, "name": "conv1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "relu_conv1", "class_name": "Activation", "config": {"name": "relu_conv1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "pool1", "class_name": "MaxPooling2D", "config": {"name": "pool1", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [3, 3]}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"name": "fire2/squeeze1x1", "class_name": "Conv2D", "config": {"filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire2/squeeze1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"name": "fire2/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire2/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]]}, {"name": "fire2/expand1x1", "class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire2/expand1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire2/expand3x3", "class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire2/expand3x3", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire2/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire2/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]]}, {"name": "fire2/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire2/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]]}, {"name": "fire2/concat", "class_name": "Concatenate", "config": {"name": "fire2/concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]]}, {"name": "fire3/squeeze1x1", "class_name": "Conv2D", "config": {"filters": 16, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire3/squeeze1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire2/concat", 0, 0, {}]]]}, {"name": "fire3/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire3/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]]}, {"name": "fire3/expand1x1", "class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire3/expand1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire3/expand3x3", "class_name": "Conv2D", "config": {"filters": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire3/expand3x3", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire3/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire3/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]]}, {"name": "fire3/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire3/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]]}, {"name": "fire3/concat", "class_name": "Concatenate", "config": {"name": "fire3/concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]]}, {"name": "pool3", "class_name": "MaxPooling2D", "config": {"name": "pool3", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [3, 3]}, "inbound_nodes": [[["fire3/concat", 0, 0, {}]]]}, {"name": "fire4/squeeze1x1", "class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire4/squeeze1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"name": "fire4/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire4/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]]}, {"name": "fire4/expand1x1", "class_name": "Conv2D", "config": {"filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire4/expand1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire4/expand3x3", "class_name": "Conv2D", "config": {"filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire4/expand3x3", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire4/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire4/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]]}, {"name": "fire4/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire4/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]]}, {"name": "fire4/concat", "class_name": "Concatenate", "config": {"name": "fire4/concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]]}, {"name": "fire5/squeeze1x1", "class_name": "Conv2D", "config": {"filters": 32, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire5/squeeze1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire4/concat", 0, 0, {}]]]}, {"name": "fire5/relu_squeeze1x1", "class_name": "Activation", "config": {"name": "fire5/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]]}, {"name": "fire5/expand1x1", "class_name": "Conv2D", "config": {"filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire5/expand1x1", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire5/expand3x3", "class_name": "Conv2D", "config": {"filters": 128, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "fire5/expand3x3", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]]}, {"name": "fire5/relu_expand1x1", "class_name": "Activation", "config": {"name": "fire5/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]]}, {"name": "fire5/relu_expand3x3", "class_name": "Activation", "config": {"name": "fire5/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]]}, {"name": "fire5/concat", "class_name": "Concatenate", "config": {"name": "fire5/concat", "trainable": true, "axis": 3}, "inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]]}, {"name": "pool5", "class_name": "MaxPooling2D", "config": {"name": "pool5", "data_format": "channels_last", "strides": [2, 2], "trainable": true, "padding": "valid", "pool_size": [3, 3]}, "inbound_nodes": [[["fire5/concat", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}, "inbound_nodes": [[["pool5", 0, 0, {}]]]}, {"name": "conv10", "class_name": "Conv2D", "config": {"filters": 2, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_regularizer": null, "name": "conv10", "activity_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_size": [1, 1], "bias_regularizer": null, "trainable": true, "use_bias": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "relu_conv10", "class_name": "Activation", "config": {"name": "relu_conv10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"name": "global_average_pooling2d_1", "class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_1", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "units": 16, "bias_regularizer": null, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "asdsasdcccc", "class_name": "Activation", "config": {"name": "asdsasdcccc", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "dense_2", "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "activation": "linear", "units": 2, "bias_regularizer": null, "trainable": true, "kernel_constraint": null}, "inbound_nodes": [[["asdsasdcccc", 0, 0, {}]]]}, {"name": "asdsasd", "class_name": "Activation", "config": {"name": "asdsasd", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "output_layers": [["asdsasd", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Model"}