{"config": [{"config": {"bias_constraint": null, "filters": 8, "activity_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 256, 256, 3], "bias_regularizer": null, "activation": "linear", "trainable": true, "name": "conv2d_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "padding": "same", "dtype": "float32", "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "filters": 16, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "name": "conv2d_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "filters": 8, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "name": "conv2d_3", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"scale": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "batch_normalization_1", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "filters": 24, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "name": "conv2d_4", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "filters": 12, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "name": "conv2d_5", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"scale": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "batch_normalization_2", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "max_pooling2d_3", "trainable": true, "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"activation": "linear", "filters": 32, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "name": "conv2d_6", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"activation": "linear", "filters": 16, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "padding": "same", "trainable": true, "name": "conv2d_7", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "strides": [1, 1], "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "use_bias": true, "kernel_size": [3, 3], "data_format": "channels_last", "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"scale": true, "gamma_constraint": null, "beta_regularizer": null, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "name": "batch_normalization_3", "gamma_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "gamma_regularizer": null, "epsilon": 0.001, "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"name": "dropout_1", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"units": 16, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_1", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_2", "trainable": true, "rate": 0.3}, "class_name": "Dropout"}, {"config": {"units": 2, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "trainable": true, "name": "dense_2", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}, {"config": {"name": "activation_8", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow"}