{"class_name": "Model", "config": {"output_layers": [["asdsasd", 0, 0]], "name": "errrr", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1", "config": {"name": "conv1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "use_bias": true, "bias_constraint": null, "strides": [2, 2], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "relu_conv1", "config": {"trainable": true, "name": "relu_conv1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "pool1", "config": {"name": "pool1", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "fire2/squeeze1x1", "config": {"name": "fire2/squeeze1x1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 8, "kernel_constraint": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "fire2/relu_squeeze1x1", "config": {"trainable": true, "name": "fire2/relu_squeeze1x1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire2/expand1x1", "config": {"name": "fire2/expand1x1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 16, "kernel_constraint": null}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire2/expand3x3", "config": {"name": "fire2/expand3x3", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "bias_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "bias_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 16, "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear"}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_4", "config": {"name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "fire2/relu_expand1x1", "config": {"trainable": true, "name": "fire2/relu_expand1x1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire2/relu_expand3x3", "config": {"trainable": true, "name": "fire2/relu_expand3x3", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire2/concat", "config": {"trainable": true, "name": "fire2/concat", "axis": 3}, "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "pool3", "config": {"name": "pool3", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "fire4/squeeze1x1", "config": {"name": "fire4/squeeze1x1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 8, "kernel_constraint": null}, "inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_5", "config": {"name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "fire4/relu_squeeze1x1", "config": {"trainable": true, "name": "fire4/relu_squeeze1x1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire4/expand1x1", "config": {"name": "fire4/expand1x1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 32, "kernel_constraint": null}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire4/expand3x3", "config": {"name": "fire4/expand3x3", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "bias_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "bias_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear"}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"name": "batch_normalization_6", "config": {"name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_7", "config": {"name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "fire4/relu_expand1x1", "config": {"trainable": true, "name": "fire4/relu_expand1x1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire4/relu_expand3x3", "config": {"trainable": true, "name": "fire4/relu_expand3x3", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire4/concat", "config": {"trainable": true, "name": "fire4/concat", "axis": 3}, "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "pool5", "config": {"name": "pool5", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true, "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "fire6/squeeze1x1", "config": {"name": "fire6/squeeze1x1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 8, "kernel_constraint": null}, "inbound_nodes": [[["pool5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_8", "config": {"name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "fire6/relu_squeeze1x1", "config": {"trainable": true, "name": "fire6/relu_squeeze1x1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire6/expand1x1", "config": {"name": "fire6/expand1x1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 64, "kernel_constraint": null}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire6/expand3x3", "config": {"name": "fire6/expand3x3", "depthwise_constraint": null, "depth_multiplier": 1, "data_format": "channels_last", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "depthwise_regularizer": null, "bias_constraint": null, "strides": [1, 1], "pointwise_regularizer": null, "bias_regularizer": null, "pointwise_constraint": null, "activity_regularizer": null, "use_bias": true, "trainable": true, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 64, "padding": "same", "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "activation": "linear"}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "class_name": "SeparableConv2D"}, {"name": "batch_normalization_9", "config": {"name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "batch_normalization_10", "config": {"name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "fire6/relu_expand1x1", "config": {"trainable": true, "name": "fire6/relu_expand1x1", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire6/relu_expand3x3", "config": {"trainable": true, "name": "fire6/relu_expand3x3", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire6/concat", "config": {"trainable": true, "name": "fire6/concat", "axis": 3}, "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.2}, "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv10", "config": {"name": "conv10", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [1, 1], "use_bias": true, "bias_constraint": null, "strides": [1, 1], "padding": "valid", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "kernel_regularizer": null, "activation": "linear", "filters": 4, "kernel_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "batch_normalization_11", "config": {"name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "trainable": true, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "epsilon": 0.001, "gamma_constraint": null}, "inbound_nodes": [[["conv10", 0, 0, {}]]], "class_name": "BatchNormalization"}, {"name": "relu_conv10", "config": {"trainable": true, "name": "relu_conv10", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "class_name": "Activation"}, {"name": "global_average_pooling2d_1", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D"}, {"name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_1", "config": {"name": "dense_1", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 16, "activation": "linear", "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "asdsasdcccc", "config": {"trainable": true, "name": "asdsasdcccc", "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "dense_2", "config": {"name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "bias_constraint": null, "trainable": true, "units": 2, "activation": "linear", "use_bias": true, "bias_regularizer": null}, "inbound_nodes": [[["asdsasdcccc", 0, 0, {}]]], "class_name": "Dense"}, {"name": "asdsasd", "config": {"trainable": true, "name": "asdsasd", "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation"}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "keras_version": "2.0.6"}