{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "use_bias": true, "padding": "same", "filters": 16, "batch_input_shape": [null, 256, 256, 3], "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "use_bias": true, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 24}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "use_bias": true, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 24}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "use_bias": true, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "use_bias": true, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "use_bias": true, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "use_bias": true, "padding": "same", "kernel_regularizer": null, "kernel_size": [3, 3], "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "kernel_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "units": 16, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5}}, {"class_name": "Dense", "config": {"name": "dense_2", "use_bias": true, "units": 2, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "bias_regularizer": null, "activation": "linear", "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "softmax"}}], "keras_version": "2.0.6"}