{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "use_bias": true, "dilation_rate": [1, 1], "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "dtype": "float32", "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "batch_input_shape": [null, 256, 256, 3], "filters": 16, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 24, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 24, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "scale": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_4", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_5", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "scale": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_6", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "name": "conv2d_7", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "kernel_regularizer": null, "activation": "linear", "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "bias_constraint": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "filters": 32, "kernel_size": [3, 3]}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.3, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "scale": true, "gamma_constraint": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001}}, {"class_name": "GlobalAveragePooling2D", "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "use_bias": true, "kernel_regularizer": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "units": 2}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "softmax", "trainable": true}}], "keras_version": "2.0.6"}