{"class_name": "Model", "keras_version": "2.0.6", "config": {"name": "errrr", "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "batch_input_shape": [null, 256, 256, 3], "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "relu_conv1", "config": {"activation": "relu", "name": "relu_conv1", "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1", "config": {"name": "pool1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2/squeeze1x1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire2/squeeze1x1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu_squeeze1x1", "config": {"activation": "relu", "name": "fire2/relu_squeeze1x1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire2/expand1x1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire2/expand3x3", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [3, 3], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu_expand1x1", "config": {"activation": "relu", "name": "fire2/relu_expand1x1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu_expand3x3", "config": {"activation": "relu", "name": "fire2/relu_expand3x3", "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "name": "fire2/concat", "config": {"axis": 3, "name": "fire2/concat", "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "pool3", "config": {"name": "pool3", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "fire4/squeeze1x1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire4/squeeze1x1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu_squeeze1x1", "config": {"activation": "relu", "name": "fire4/relu_squeeze1x1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire4/expand1x1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire4/expand3x3", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [3, 3], "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu_expand1x1", "config": {"activation": "relu", "name": "fire4/relu_expand1x1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu_expand3x3", "config": {"activation": "relu", "name": "fire4/relu_expand3x3", "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "name": "fire4/concat", "config": {"axis": 3, "name": "fire4/concat", "trainable": true}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "pool5", "config": {"name": "pool5", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "pool_size": [3, 3], "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "fire6/squeeze1x1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire6/squeeze1x1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "name": "fire6/relu_squeeze1x1", "config": {"activation": "relu", "name": "fire6/relu_squeeze1x1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand1x1", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire6/expand1x1", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Conv2D", "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand3x3", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "fire6/expand3x3", "strides": [1, 1], "padding": "same", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [3, 3], "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "name": "fire6/relu_expand1x1", "config": {"activation": "relu", "name": "fire6/relu_expand1x1", "trainable": true}}, {"class_name": "Activation", "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "name": "fire6/relu_expand3x3", "config": {"activation": "relu", "name": "fire6/relu_expand3x3", "trainable": true}}, {"class_name": "Concatenate", "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "name": "fire6/concat", "config": {"axis": 3, "name": "fire6/concat", "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "name": "dropout_1", "config": {"rate": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Conv2D", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "conv10", "config": {"dilation_rate": [1, 1], "bias_constraint": null, "name": "conv10", "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "use_bias": true, "trainable": true, "kernel_size": [1, 1], "filters": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["conv10", 0, 0, {}]]], "name": "relu_conv10", "config": {"activation": "relu", "name": "relu_conv10", "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"data_format": "channels_last", "name": "global_average_pooling2d_1", "trainable": true}}, {"class_name": "Dropout", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "dropout_2", "config": {"rate": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_1", "config": {"bias_constraint": null, "name": "dense_1", "use_bias": true, "units": 16, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "asdsasdcccc", "config": {"activation": "relu", "name": "asdsasdcccc", "trainable": true}}, {"class_name": "Dense", "inbound_nodes": [[["asdsasdcccc", 0, 0, {}]]], "name": "dense_2", "config": {"bias_constraint": null, "name": "dense_2", "use_bias": true, "units": 2, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null}}, {"class_name": "Activation", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "asdsasd", "config": {"activation": "softmax", "name": "asdsasd", "trainable": true}}], "output_layers": [["asdsasd", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}