{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6", "config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_1", "bias_regularizer": null, "kernel_size": [3, 3], "dtype": "float32", "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "batch_input_shape": [null, 256, 256, 3], "filters": 8}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_2", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 16}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.15}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_3", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 8}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_4", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 24}}, {"class_name": "Activation", "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.2}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_5", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 12}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.25}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_6", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 32}}, {"class_name": "Activation", "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_7", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 16}}, {"class_name": "Activation", "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "center": true, "trainable": true, "beta_regularizer": null, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "beta_constraint": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "name": "conv2d_8", "bias_regularizer": null, "kernel_size": [3, 3], "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 1}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_1", "bias_regularizer": null, "use_bias": true, "trainable": true, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 2}}, {"class_name": "Activation", "config": {"name": "activation_7", "activation": "softmax", "trainable": true}}]}