{"backend": "tensorflow", "keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 8, "trainable": true, "name": "conv2d_1", "kernel_size": [3, 3], "kernel_regularizer": null, "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "batch_input_shape": [null, 256, 256, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_1", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 16, "trainable": true, "name": "conv2d_2", "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.15}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 8, "trainable": true, "name": "conv2d_3", "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "center": true, "trainable": true, "name": "batch_normalization_1", "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_2", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 24, "trainable": true, "name": "conv2d_4", "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 12, "trainable": true, "name": "conv2d_5", "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "center": true, "trainable": true, "name": "batch_normalization_2", "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "trainable": true, "name": "max_pooling2d_3", "pool_size": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 32, "trainable": true, "name": "conv2d_6", "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.25}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 16, "trainable": true, "name": "conv2d_7", "kernel_size": [3, 3], "data_format": "channels_last", "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.3}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "center": true, "trainable": true, "name": "batch_normalization_3", "gamma_constraint": null, "gamma_regularizer": null, "axis": -1, "scale": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_1", "activation": "linear", "bias_constraint": null, "units": 16, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "name": "dense_2", "activation": "linear", "bias_constraint": null, "units": 2, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "softmax"}}]}