{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 8, "batch_input_shape": [null, 256, 256, 3], "activation": "linear", "name": "conv2d_1", "data_format": "channels_last", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 16, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_2", "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.15, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_3", "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 24, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_4", "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_5", "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_3"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"filters": 32, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_6", "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.25, "name": "dropout_4"}}, {"class_name": "Conv2D", "config": {"filters": 8, "kernel_size": [3, 3], "trainable": true, "name": "conv2d_7", "data_format": "channels_last", "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "strides": [1, 1], "padding": "same", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.3, "name": "dropout_5"}}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 16, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "trainable": true, "units": 2, "name": "dense_2", "kernel_constraint": null, "kernel_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_8"}}], "keras_version": "2.0.6", "backend": "tensorflow"}