{"config": [{"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "batch_input_shape": [null, 256, 256, 3], "name": "conv2d_1", "filters": 8, "data_format": "channels_last", "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "strides": [1, 1], "dtype": "float32", "padding": "same", "bias_regularizer": null, "kernel_constraint": null, "kernel_size": [3, 3], "bias_constraint": null, "dilation_rate": [1, 1], "trainable": true, "activity_regularizer": null, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "SeparableConv2D", "config": {"pointwise_constraint": null, "padding": "same", "name": "separable_conv2d_1", "filters": 16, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.15}}, {"class_name": "SeparableConv2D", "config": {"pointwise_constraint": null, "padding": "same", "name": "separable_conv2d_2", "filters": 16, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "SeparableConv2D", "config": {"pointwise_constraint": null, "padding": "same", "name": "separable_conv2d_3", "filters": 24, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"class_name": "SeparableConv2D", "config": {"pointwise_constraint": null, "padding": "same", "name": "separable_conv2d_4", "filters": 24, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "trainable": true, "strides": [2, 2]}}, {"class_name": "SeparableConv2D", "config": {"pointwise_constraint": null, "padding": "same", "name": "separable_conv2d_5", "filters": 32, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.25}}, {"class_name": "SeparableConv2D", "config": {"pointwise_constraint": null, "padding": "same", "name": "separable_conv2d_6", "filters": 32, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "depth_multiplier": 1, "depthwise_constraint": null, "strides": [1, 1], "activity_regularizer": null, "activation": "linear", "kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "dilation_rate": [1, 1], "pointwise_regularizer": null, "trainable": true, "data_format": "channels_last", "depthwise_regularizer": null, "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.3}}, {"class_name": "BatchNormalization", "config": {"gamma_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "scale": true, "momentum": 0.99, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "beta_constraint": null, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "units": 16, "bias_regularizer": null, "name": "dense_1", "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}}, "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "units": 2, "bias_regularizer": null, "name": "dense_2", "trainable": true, "use_bias": true}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_8"}}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}