{"backend": "tensorflow", "keras_version": "2.0.6", "config": {"layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"name": "input_1", "batch_input_shape": [null, 256, 256, 3], "dtype": "float32", "sparse": false}}, {"name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_1", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8}}, {"name": "activation_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_2", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16}}, {"name": "activation_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"name": "dropout_1", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "rate": 0.15}}, {"name": "conv2d_3", "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_3", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 8}}, {"name": "activation_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"name": "batch_normalization_1", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"name": "max_pooling2d_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_4", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_4", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 24}}, {"name": "activation_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"name": "dropout_2", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}}, {"name": "conv2d_5", "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_5", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 12}}, {"name": "dropout_3", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}}, {"name": "batch_normalization_2", "inbound_nodes": [[["dropout_3", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"name": "max_pooling2d_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"name": "conv2d_6", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_6", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32}}, {"name": "activation_5", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"name": "dropout_4", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "rate": 0.25}}, {"name": "conv2d_7", "inbound_nodes": [[["dropout_4", 0, 0, {}]]], "class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "name": "conv2d_7", "bias_constraint": null, "kernel_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "data_format": "channels_last", "dilation_rate": [1, 1], "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16}}, {"name": "activation_6", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "relu"}}, {"name": "dropout_5", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "rate": 0.3}}, {"name": "batch_normalization_3", "inbound_nodes": [[["dropout_5", 0, 0, {}]]], "class_name": "BatchNormalization", "config": {"center": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "gamma_constraint": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null}}, {"name": "global_average_pooling2d_1", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D", "config": {"trainable": true, "name": "global_average_pooling2d_1", "data_format": "channels_last"}}, {"name": "global_max_pooling2d_1", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "GlobalMaxPooling2D", "config": {"trainable": true, "name": "global_max_pooling2d_1", "data_format": "channels_last"}}, {"name": "concatenate_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}], ["global_max_pooling2d_1", 0, 0, {}]]], "class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"name": "dense_1", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_1", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_7", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_7", "activation": "relu"}}, {"name": "dense_2", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "class_name": "Dense", "config": {"bias_regularizer": null, "kernel_constraint": null, "name": "dense_2", "bias_constraint": null, "trainable": true, "kernel_regularizer": null, "use_bias": true, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "activation_8", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation", "config": {"trainable": true, "name": "activation_8", "activation": "softmax"}}], "name": "model_1", "output_layers": [["activation_8", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model"}