{"config": [{"config": {"use_bias": true, "filters": 8, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "batch_input_shape": [null, 256, 256, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "conv2d_1", "strides": [1, 1], "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 16, "kernel_constraint": null, "name": "conv2d_2", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.15, "name": "dropout_1", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "filters": 8, "kernel_constraint": null, "name": "conv2d_3", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 24, "kernel_constraint": null, "name": "conv2d_4", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.2, "name": "dropout_2", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "filters": 12, "kernel_constraint": null, "name": "conv2d_5", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"rate": 0.25, "name": "dropout_3", "trainable": true}, "class_name": "Dropout"}, {"config": {"padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2], "name": "max_pooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"use_bias": true, "filters": 32, "kernel_constraint": null, "name": "conv2d_6", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.25, "name": "dropout_4", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "filters": 16, "kernel_constraint": null, "name": "conv2d_7", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"rate": 0.3, "name": "dropout_5", "trainable": true}, "class_name": "Dropout"}, {"config": {"use_bias": true, "filters": 1, "kernel_constraint": null, "name": "conv2d_8", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "padding": "same", "activity_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "kernel_size": [3, 3], "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null, "bias_constraint": null, "units": 2, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"name": "activation_7", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.0.6"}