{"config": {"name": "errrr", "output_layers": [["asdsasd", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 256, 256, 3], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "conv1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 64, "strides": [2, 2], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "conv1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "relu_conv1", "config": {"name": "relu_conv1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "pool1", "config": {"padding": "valid", "name": "pool1", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "fire2/squeeze1x1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 8, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire2/squeeze1x1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire2/relu_squeeze1x1", "config": {"name": "fire2/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire2/expand1x1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire2/expand1x1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire2/expand3x3", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire2/expand3x3", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire2/relu_expand1x1", "config": {"name": "fire2/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire2/relu_expand3x3", "config": {"name": "fire2/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire2/concat", "config": {"name": "fire2/concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "pool3", "config": {"padding": "valid", "name": "pool3", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "fire4/squeeze1x1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire4/squeeze1x1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["pool3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire4/relu_squeeze1x1", "config": {"name": "fire4/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire4/expand1x1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire4/expand1x1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire4/expand3x3", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire4/expand3x3", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire4/relu_expand1x1", "config": {"name": "fire4/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire4/relu_expand3x3", "config": {"name": "fire4/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire4/concat", "config": {"name": "fire4/concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "pool5", "config": {"padding": "valid", "name": "pool5", "pool_size": [3, 3], "data_format": "channels_last", "strides": [2, 2], "trainable": true}, "inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "fire6/squeeze1x1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 16, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire6/squeeze1x1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["pool5", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire6/relu_squeeze1x1", "config": {"name": "fire6/relu_squeeze1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire6/expand1x1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire6/expand1x1", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire6/expand3x3", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [3, 3], "data_format": "channels_last", "filters": 32, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "same", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "fire6/expand3x3", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "fire6/relu_expand1x1", "config": {"name": "fire6/relu_expand1x1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire6/relu_expand3x3", "config": {"name": "fire6/relu_expand3x3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "class_name": "Activation"}, {"name": "fire6/concat", "config": {"name": "fire6/concat", "axis": 3, "trainable": true}, "inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "class_name": "Concatenate"}, {"name": "dropout_1", "config": {"name": "dropout_1", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "conv10", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_size": [1, 1], "data_format": "channels_last", "filters": 4, "strides": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "padding": "valid", "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "conv10", "dilation_rate": [1, 1], "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "relu_conv10", "config": {"name": "relu_conv10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["conv10", 0, 0, {}]]], "class_name": "Activation"}, {"name": "global_average_pooling2d_1", "config": {"name": "global_average_pooling2d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "class_name": "GlobalAveragePooling2D"}, {"name": "dropout_2", "config": {"name": "dropout_2", "rate": 0.2, "trainable": true}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense_1", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 16, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "dense_1", "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "asdsasdcccc", "config": {"name": "asdsasdcccc", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Activation"}, {"name": "dense_2", "config": {"use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true, "units": 2, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "activation": "linear", "name": "dense_2", "activity_regularizer": null}, "inbound_nodes": [[["asdsasdcccc", 0, 0, {}]]], "class_name": "Dense"}, {"name": "asdsasd", "config": {"name": "asdsasd", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Activation"}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.6"}