{"class_name": "Sequential", "keras_version": "2.0.6", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"filters": 16, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "name": "conv2d_1", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "batch_input_shape": [null, 256, 256, 3], "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"filters": 24, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 24, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_1", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_3", "trainable": true, "data_format": "channels_last"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_2", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Conv2D", "config": {"filters": 32, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"scale": true, "beta_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_3", "trainable": true, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "momentum": 0.99, "axis": -1, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_regularizer": null}}, {"class_name": "Conv2D", "config": {"filters": 1, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_8", "activity_regularizer": null, "trainable": true, "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "data_format": "channels_last", "padding": "same", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "strides": [1, 1], "bias_regularizer": null}}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "name": "dense_1", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "softmax"}}]}