{"class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 256, 256, 3], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "conv1", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "relu_conv1", "config": {"trainable": true, "name": "relu_conv1", "activation": "relu"}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "pool1", "config": {"trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "pool1", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["relu_conv1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "fire2/squeeze1x1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "fire2/squeeze1x1", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 8, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["pool1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "fire2/relu_squeeze1x1", "config": {"trainable": true, "name": "fire2/relu_squeeze1x1", "activation": "relu"}, "inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "fire2/expand1x1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "fire2/expand1x1", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 32, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "fire2/expand3x3", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "fire2/expand3x3", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "fire2/relu_expand1x1", "config": {"trainable": true, "name": "fire2/relu_expand1x1", "activation": "relu"}, "inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "fire2/relu_expand3x3", "config": {"trainable": true, "name": "fire2/relu_expand3x3", "activation": "relu"}, "inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "fire2/concat", "config": {"trainable": true, "axis": 3, "name": "fire2/concat"}, "inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "pool3", "config": {"trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "pool3", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["fire2/concat", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "fire4/squeeze1x1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "fire4/squeeze1x1", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 16, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["pool3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "fire4/relu_squeeze1x1", "config": {"trainable": true, "name": "fire4/relu_squeeze1x1", "activation": "relu"}, "inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "fire4/expand1x1", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "fire4/expand1x1", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 64, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "fire4/expand3x3", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "fire4/expand3x3", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "kernel_size": [3, 3], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "fire4/relu_expand1x1", "config": {"trainable": true, "name": "fire4/relu_expand1x1", "activation": "relu"}, "inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "fire4/relu_expand3x3", "config": {"trainable": true, "name": "fire4/relu_expand3x3", "activation": "relu"}, "inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]]}, {"class_name": "Concatenate", "name": "fire4/concat", "config": {"trainable": true, "axis": 3, "name": "fire4/concat"}, "inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "pool5", "config": {"trainable": true, "pool_size": [3, 3], "padding": "valid", "name": "pool5", "data_format": "channels_last", "strides": [2, 2]}, "inbound_nodes": [[["fire4/concat", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "inbound_nodes": [[["pool5", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv10", "config": {"kernel_regularizer": null, "kernel_constraint": null, "name": "conv10", "use_bias": true, "data_format": "channels_last", "bias_regularizer": null, "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "trainable": true, "dilation_rate": [1, 1], "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 2, "kernel_size": [1, 1], "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "relu_conv10", "config": {"trainable": true, "name": "relu_conv10", "activation": "relu"}, "inbound_nodes": [[["conv10", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "inbound_nodes": [[["relu_conv10", 0, 0, {}]]]}, {"class_name": "Dropout", "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.2}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_1", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 16, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "asdsasdcccc", "config": {"trainable": true, "name": "asdsasdcccc", "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "name": "dense_2", "config": {"kernel_regularizer": null, "trainable": true, "use_bias": true, "units": 2, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["asdsasdcccc", 0, 0, {}]]]}, {"class_name": "Activation", "name": "asdsasd", "config": {"trainable": true, "name": "asdsasd", "activation": "softmax"}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}], "output_layers": [["asdsasd", 0, 0]], "name": "errrr", "input_layers": [["input_1", 0, 0]]}, "keras_version": "2.0.6"}